{
  "projects": [
    {
      "id": "tsavvy",
      "title": " Tsavvy",
      "description": "I have developed an informational web application using ReactJS that integrates the Blogger API to dynamically manage content, allowing administrators to update posts without modifying code. I used Axios for HTTP requests, which ensures synchronization with Blogger posts, and React Router DOM for seamless navigation between pages such as the list of posts and details of each article. The application was built using Vite to take advantage of its performance and rapid development environment.",
      "url": "https://www.tsavvy.com.ar/",
      "repository": "https://github.com/lautiok/tsavvy",
      "category": "Frontend",
      "techologies": ["Reactjs", "Blogger", "Vercel"],
      "images": [
        {
          "id": 1,
          "image": "tsavvy.webp"
        },
        {
          "id": 2,
          "image": "tsavvy_dos.webp"
        }
      ]
    },

    {
      "id": "hltransporte",
      "title": "HL Transporte",
      "description": "I developed the website for HL Transporte, a tourism company, using ReactJS and Next.js. The page includes sections for services, destinations, clients and about us, as well as an integrated quote system that allows forms to be sent via WhatsApp. I contributed to improving the user experience and functionality of the site, optimizing its performance and usability",
      "url": "https://hltransporte.vercel.app/",
      "repository": "https://github.com/lautiok/hltransporte",
      "category": "Frontend",
      "techologies": ["Reactjs", "Nextjs", "Vercel"],
      "images": [
        {
          "id": 1,
          "image": "hltransporte.webp"
        },
        {
          "id": 2,
          "image": "hltransporte_dos.webp"
        },
        {
          "id": 3,
          "image": "hltransporte_tres.webp"
        },
        {
          "id": 4,
          "image": "hltransporte_cuatro.webp"
        }
      ]
    },
    {
      "id": "arch",
      "title": "Arch Architecture",
      "description": "I developed the Arch website, a portal about modern architecture and interior design, using ReactJS, Next.js and TypeScript. The site includes an interactive portfolio of featured projects, designed with a minimalist and modern approach, optimizing the user experience on any device. I implemented a reliable deployment with Vercel, ensuring smooth and scalable performance. This project reflects my passion for combining technology and design to create impactful and functional solutions.",
      "url": "https://arch-plum.vercel.app/",
      "repository": "https://github.com/lautiok/arch",
      "category": "Frontend",
      "techologies": ["Typescript", "React", "Nextjs", "Vercel"],
      "color": "#9A7D5F",
      "images": [
        {
          "id": 1,
          "image": "arch.webp"
        },
        {
          "id": 2,
          "image": "arch_uno.webp"
        }
      ]
    },
    {
      "id": "safepaws",
      "title": "SafePaws",
      "description": "The adoption web was built using ReactJS for the frontend and Node.js with Express for the backend.",
      "url": "https://adoption-web-application.vercel.app/",
      "repository": "https://github.com/lautiok/Adoption-web-application/tree/main/backend",
      "category": "Backend",
      "techologies": ["React", "NodeJS", "Express", "MongoDB", "Vercel"],
      "color": "#9A7D5F"
    },
    {
      "id": "motorclycle",
      "title": "Motorclycle",
      "description": "The online store was built using ReactJS for the frontend and Node.js with Express for the backend.",
      "repository": "https://github.com/lautiok/Ecommerce/tree/main/backend",
      "category": "Backend",
      "techologies": ["NodeJS", "MongoDB", "React"]
    },
    {
      "id": "rentsale",
      "title": "Rentsale",
      "description": "I developed a web application for a real estate agency using ReactJS on the frontend, allowing for efficient property management. The application uses Axios to make API requests and React Router DOM for seamless navigation between sections. I incorporated React Helmet and React Helmet Async for improved SEO and metadata management, while React Hook Form facilitates form validation and management. I also included React Hot Toast for engaging notifications, React Select for selecting properties, and React Slick along with Slick Carousel to implement a responsive carousel, offering an intuitive and modern user experience.",
      "repository": "https://github.com/lautiok/real_estate/tree/master/client",
      "category": "Frontend",
      "techologies": ["Reactjs", "NodeJS", "Express", "MongoDB", "Vercel"],
      "images": [
        {
          "id": 1,
          "image": "rentsale.webp"
        },
        {
          "id": 2,
          "image": "rentsale_tres.webp"
        },
        {
          "id": 3,
          "image": "rentsale_dos.webp"
        }
      ]
    },
    {
      "id": "florcitanails",
      "title": "FlorcitaNails",
      "description": "I developed a complete platform for Florcita Nails using ReactJS, Next.js, and Node.js, with PostgreSQL and Prisma for data management. The system includes an informative website, online booking, student statistics, and an academic section with fully managed virtual courses. Each course consists of chapters with video lessons and exams, and automatically generates personalized certificates with a verifiable QR code. I also integrated MercadoPago as the payment gateway and built an internal dashboard to manage enrollments, students, and course content.",
      "url": "https://florcitanails.vercel.app/",
      "repository": "https://github.com/lautiok/florcitanails",
      "category": "Frontend",
      "techologies": ["Reactjs", "Nextjs", "PostgreSQL", "Prisma"],
      "images": [
        {
          "id": 1,
          "image": "florcitanailss.webp"
        },
        {
          "id": 2,
          "image": "florcitanailss-login.webp"
        },
        {
          "id": 3,
          "image": "florcitanailss-certificados.webp"
        },
        {
          "id": 4,
          "image": "florcitanailss-añadircertificado.webp"
        },
        {
          "id": 5,
          "image": "florcitanailss-certificado.webp"
        }
      ]
    },
    {
      "id": "intercambia",
      "title": "Intercambia",
      "description": "I developed Intercambia, a web platform built with Next.js, Express, and MongoDB, designed to facilitate book exchanges among students within educational institutions. Users register based on their school, list available books, and create exchange requests with other students. Once both parties accept, a real-time chat powered by Socket.io is enabled to coordinate the handoff. After completing the exchange, users confirm it through the platform, marking the process as finished. The application handles authentication, matching logic, and exchange tracking in a secure and efficient way.",
      "repository": "https://github.com/lautiok/intercambio",
      "category": "Frontend",
      "techologies": ["Nextjs", "Express", "MongoDB", "Socket.io"],
      "images": [
        {
          "id": 1,
          "image": "intercambia.webp"
        },
        {
          "id": 2,
          "image": "intercambia_dos.webp"
        },
        {
          "id": 3,
          "image": "intercambia_tres.webp"
        },
        {
          "id": 4,
          "image": "intercambia_cuatro.webp"
        }
      ]
    }
  ]
}
