{
  "projects": [
    {
      "id": "tsavvy",
      "title": "Tsavvy",
      "description": "He desarrollado una aplicación web informativa con ReactJS que integra la API de Blogger para gestionar el contenido de manera dinámica, permitiendo a los administradores actualizar publicaciones sin modificar el código. Utilicé Axios para las solicitudes HTTP, lo que asegura la sincronización con las entradas de Blogger, y React Router DOM para una navegación fluida entre páginas como la lista de publicaciones y los detalles de cada artículo. La aplicación fue creada con Vite para aprovechar su rendimiento y su entorno de desarrollo rápido.",
      "url": "https://www.tsavvy.com.ar/",
      "repository": "https://github.com/lautiok/tsavvy",
      "category": "Frontend",
      "techologies": ["Reactjs", "Blogger", "Vercel"],
      "images": [
        {
          "id": 1,
          "image": "tsavvy.webp"
        },
        {
          "id": 2,
          "image": "tsavvy_dos.webp"
        }
      ]
    },

    {
      "id": "hltransporte",
      "title": "HL Transporte",
      "description": "Desarrollé el sitio web de HL Transporte, una empresa de turismo, utilizando ReactJS y Next.js. La página incluye secciones de servicios, destinos, clientes y sobre nosotros, además de un sistema de cotizaciones integrado que permite enviar formularios a través de WhatsApp. Contribuí a mejorar la experiencia del usuario y la funcionalidad del sitio, optimizando su rendimiento y usabilidad.",
      "url": "https://hltransporte.vercel.app/",
      "repository": "https://github.com/lautiok/hltransporte",
      "category": "Frontend",
      "techologies": ["Reactjs", "Nextjs", "Vercel"],
      "images": [
        {
          "id": 1,
          "image": "hltransporte.webp"
        },
        {
          "id": 2,
          "image": "hltransporte_dos.webp"
        },
        {
          "id": 3,
          "image": "hltransporte_tres.webp"
        },
        {
          "id": 4,
          "image": "hltransporte_cuatro.webp"
        }
      ]
    },
    {
      "id": "codear",
      "title": "Codear",
      "description": "He desarrollado Codear Marketing utilizando ReactJS para ofrecer una presentación innovadora y atractiva de servicios y misión, mejorando la experiencia del usuario. Implementé React Router DOM para una navegación fluida, React Helmet Async para la gestión de los metadatos y SEO, y React Transition Group para crear transiciones suaves entre las distintas secciones de la web. Esto permite una interfaz dinámica, optimizada para el marketing digital y orientada a mejorar la visibilidad y presentación de la marca.",
      "url": "https://www.codear.ar/",
      "repository": "https://github.com/lautiok/codear",
      "category": "Frontend",
      "techologies": ["React", "Vercel"],
      "color": "#9A7D5F",
      "images": [
        {
          "id": 1,
          "image": "codear.webp"
        },
        {
          "id": 2,
          "image": "codear_dos.webp"
        },
        {
          "id": 3,
          "image": "codear_tres.webp"
        },
        {
          "id": 4,
          "image": "codear_cuatro.webp"
        }
      ]
    },
    {
      "id": "buenosamigos",
      "title": "Buenos Amigos",
      "description": "He desarrollado un proyecto para una cafetería utilizando ReactJS, que permite visualizar el stock de bebidas a través de una integración con una API Rest. Implementé Axios para realizar las solicitudes a la API, React Router DOM para gestionar la navegación entre páginas, y React Helmet para optimizar el SEO y la gestión de los metadatos. Además, se utilizó Bootstrap para el diseño responsivo y una interfaz atractiva, brindando una experiencia de usuario intuitiva y moderna.",
      "url": "https://coffe-wheat.vercel.app/",
      "repository": "https://github.com/lautiok/coffe",
      "category": "Frontend",
      "techologies": ["React", "Vercel"],
      "color": "#9A7D5F",
      "images": [
        {
          "id": 1,
          "image": "buenosamigos.webp"
        },
        {
          "id": 2,
          "image": "buenosamigos_dos.webp"
        },
        {
          "id": 3,
          "image": "buenosamigos_tres.webp"
        },
        {
          "id": 4,
          "image": "buenosamigos_cuatro.webp"
        }
      ]
    },
    {
      "id": "safepaws",
      "title": "SafePaws",
      "description": "El sitio web de adopción fue construido usando ReactJS para el frontend y Node.js con Express para el backend.",
      "url": "https://adoption-web-application.vercel.app/",
      "repository": "https://github.com/lautiok/Adoption-web-application/tree/main/backend",
      "category": "Backend",
      "techologies": ["React", "NodeJS", "Express", "MongoDB", "Vercel"],
      "color": "#9A7D5F"
    },
    {
      "id": "motorclycle",
      "title": "Motorclycle",
      "description": "La tienda en línea fue construida usando ReactJS para el frontend y Node.js con Express para el backend.",
      "repository": "https://github.com/lautiok/Ecommerce/tree/main/backend",
      "category": "Backend",
      "techologies": ["NodeJS", "MongoDB", "React"]
    },
    {
      "id": "rentsale",
      "title": "Rentsale",
      "description": "Desarrollé una aplicación web para una agencia inmobiliaria utilizando ReactJS en el frontend, lo que permite una gestión eficiente de las propiedades. La aplicación utiliza Axios para realizar solicitudes a la API y React Router DOM para una navegación fluida entre las distintas secciones. Incorporé React Helmet y React Helmet Async para mejorar el SEO y la gestión de metadatos, mientras que React Hook Form facilita la validación y gestión de formularios. También incluí React Hot Toast para notificaciones atractivas, React Select para seleccionar propiedades, y React Slick junto con Slick Carousel para implementar un carrusel responsivo, ofreciendo una experiencia de usuario intuitiva y moderna.",
      "repository": "https://github.com/lautiok/real_estate/tree/master/client",
      "category": "Frontend",
      "techologies": ["Reactjs", "NodeJS", "Express", "MongoDB", "Vercel"],
      "images": [
        {
          "id": 1,
          "image": "rentsale.webp"
        },
        {
          "id": 2,
          "image": "rentsale_tres.webp"
        },
        {
          "id": 3,
          "image": "rentsale_dos.webp"
        }
      ]
    },
    {
      "id": "florcitanails",
      "title": "FlorcitaNails",
      "description": "Desarrollé el sitio web de Florcita Nails, un salón de belleza de uñas, utilizando ReactJS y Next.js. El sitio muestra los últimos servicios realizados, incluye una sección de reservas en línea, estadísticas de alumnas recibidas, y un apartado detallado de nuestros servicios. También creé una sección dedicada a la academia, con información sobre los cursos que ofrecen. Además, desarrollé una plataforma para gestionar los cursos, brindando una experiencia completa tanto para clientes como para estudiantes.",
      "url": "https://florcitanails.vercel.app/",
      "repository": "https://github.com/lautiok/florcitanails",
      "category": "Frontend",
      "techologies": ["Reactjs", "Nextjs", "Vercel"],
      "images": [
        {
          "id": 1,
          "image": "florcitanailss.webp"
        },
        {
          "id": 2,
          "image": "florcitanailss-cinco.webp"
        },
        {
          "id": 5,
          "image": "florcitanailss-login.webp"
        },
        {
          "id": 3,
          "image": "florcitanailss-certificados.webp"
        },
        {
          "id": 4,
          "image": "florcitanailss-añadircertificado.webp"
        },
        {
          "id": 6,
          "image": "florcitanailss-certificado.webp"
        }
      ]
    }
  ]
}
