{
  "projects": [
    {
      "id": "tsavvy",
      "title": "Tsavvy",
      "description": "He desarrollado una aplicación web informativa con ReactJS que integra la API de Blogger para gestionar el contenido de manera dinámica, permitiendo a los administradores actualizar publicaciones sin modificar el código. Utilicé Axios para las solicitudes HTTP, lo que asegura la sincronización con las entradas de Blogger, y React Router DOM para una navegación fluida entre páginas como la lista de publicaciones y los detalles de cada artículo. La aplicación fue creada con Vite para aprovechar su rendimiento y su entorno de desarrollo rápido.",
      "url": "https://www.tsavvy.com.ar/",
      "repository": "https://github.com/lautiok/tsavvy",
      "category": "Frontend",
      "techologies": ["Reactjs", "Blogger", "Vercel"],
      "images": [
        {
          "id": 1,
          "image": "tsavvy.webp"
        },
        {
          "id": 2,
          "image": "tsavvy_dos.webp"
        }
      ]
    },

    {
      "id": "hltransporte",
      "title": "HL Transporte",
      "description": "Desarrollé el sitio web de HL Transporte, una empresa de turismo, utilizando ReactJS y Next.js. La página incluye secciones de servicios, destinos, clientes y sobre nosotros, además de un sistema de cotizaciones integrado que permite enviar formularios a través de WhatsApp. Contribuí a mejorar la experiencia del usuario y la funcionalidad del sitio, optimizando su rendimiento y usabilidad.",
      "url": "https://hltransporte.vercel.app/",
      "repository": "https://github.com/lautiok/hltransporte",
      "category": "Frontend",
      "techologies": ["Reactjs", "Nextjs", "Vercel"],
      "images": [
        {
          "id": 1,
          "image": "hltransporte.webp"
        },
        {
          "id": 2,
          "image": "hltransporte_dos.webp"
        },
        {
          "id": 3,
          "image": "hltransporte_tres.webp"
        },
        {
          "id": 4,
          "image": "hltransporte_cuatro.webp"
        }
      ]
    },
    {
      "id": "arch",
      "title": "Arch Arquitectura",
      "description": "Desarrollé el sitio web de Arch, un portal sobre arquitectura moderna y diseño de interiores, utilizando ReactJS, Next.js y TypeScript. El sitio incluye un portafolio interactivo de proyectos destacados, diseñado con un enfoque minimalista y moderno, optimizando la experiencia del usuario en cualquier dispositivo. Implementé un despliegue confiable con Vercel, asegurando un rendimiento fluido y escalable. Este proyecto refleja mi pasión por combinar tecnología y diseño para crear soluciones impactantes y funcionales.",
      "url": "https://arch-plum.vercel.app/",
      "repository": "https://github.com/lautiok/arch",
      "category": "Frontend",
      "techologies": ["Typescript", "React", "Nextjs", "Vercel"],
      "color": "#9A7D5F",
      "images": [
        {
          "id": 1,
          "image": "arch.webp"
        },
        {
          "id": 2,
          "image": "arch_uno.webp"
        }
      ]
    },
    {
      "id": "safepaws",
      "title": "SafePaws",
      "description": "El sitio web de adopción fue construido usando ReactJS para el frontend y Node.js con Express para el backend.",
      "url": "https://adoption-web-application.vercel.app/",
      "repository": "https://github.com/lautiok/Adoption-web-application/tree/main/backend",
      "category": "Backend",
      "techologies": ["React", "NodeJS", "Express", "MongoDB", "Vercel"],
      "color": "#9A7D5F"
    },
    {
      "id": "motorclycle",
      "title": "Motorclycle",
      "description": "La tienda en línea fue construida usando ReactJS para el frontend y Node.js con Express para el backend.",
      "repository": "https://github.com/lautiok/Ecommerce/tree/main/backend",
      "category": "Backend",
      "techologies": ["NodeJS", "MongoDB", "React"]
    },
    {
      "id": "rentsale",
      "title": "Rentsale",
      "description": "Desarrollé una aplicación web para una agencia inmobiliaria utilizando ReactJS en el frontend, lo que permite una gestión eficiente de las propiedades. La aplicación utiliza Axios para realizar solicitudes a la API y React Router DOM para una navegación fluida entre las distintas secciones. Incorporé React Helmet y React Helmet Async para mejorar el SEO y la gestión de metadatos, mientras que React Hook Form facilita la validación y gestión de formularios. También incluí React Hot Toast para notificaciones atractivas, React Select para seleccionar propiedades, y React Slick junto con Slick Carousel para implementar un carrusel responsivo, ofreciendo una experiencia de usuario intuitiva y moderna.",
      "repository": "https://github.com/lautiok/real_estate/tree/master/client",
      "category": "Frontend",
      "techologies": ["Reactjs", "NodeJS", "Express", "MongoDB", "Vercel"],
      "images": [
        {
          "id": 1,
          "image": "rentsale.webp"
        },
        {
          "id": 2,
          "image": "rentsale_tres.webp"
        },
        {
          "id": 3,
          "image": "rentsale_dos.webp"
        }
      ]
    },
    {
      "id": "florcitanails",
      "title": "FlorcitaNails",
      "description": "Desarrollé una plataforma completa para Florcita Nails utilizando ReactJS, Next.js y Node.js, con PostgreSQL y Prisma para la gestión de datos. El sistema incluye una web informativa, reservas online, estadísticas de alumnas y una sección académica con cursos virtuales administrados desde la plataforma. Cada curso está compuesto por capítulos con video clases y exámenes, y genera automáticamente certificados personalizados con QR verificable. Además, integré MercadoPago como pasarela de pagos y un panel interno para gestionar inscripciones, estudiantes y contenidos.",
      "url": "https://florcitanails.vercel.app/",
      "repository": "https://github.com/lautiok/florcitanails",
      "category": "Frontend",
      "techologies": ["Reactjs", "Nextjs", "PostgreSQL", "Prisma"],
      "images": [
        {
          "id": 1,
          "image": "florcitanailss.webp"
        },
        {
          "id": 2,
          "image": "florcitanailss-cinco.webp"
        },
        {
          "id": 5,
          "image": "florcitanailss-login.webp"
        },
        {
          "id": 3,
          "image": "florcitanailss-certificados.webp"
        },
        {
          "id": 4,
          "image": "florcitanailss-añadircertificado.webp" 
        },
        {
          "id": 6,
          "image": "florcitanailss-certificado.webp"
        }
      ]
    },
      {
      "id": "intercambia",
      "title": "Intercambia",
      "description": "Desarrollé Intercambia, una plataforma web construida con Next.js, Express y MongoDB, orientada a facilitar el intercambio de libros entre estudiantes de instituciones educativas. Los usuarios se registran según su escuela, publican libros disponibles y generan órdenes de intercambio con otros estudiantes. Una vez que ambas partes aceptan, se habilita un chat en tiempo real mediante Socket.io para coordinar la entrega. Al concretar el intercambio, ambos usuarios lo confirman desde la plataforma, finalizando el proceso. La aplicación gestiona autenticación, lógica de emparejamiento y seguimiento del estado de forma eficiente y segura.",
      "repository": "https://github.com/lautiok/intercambio",
      "category": "Frontend",
      "techologies": ["Nextjs", "Express", "MongoDB", "Socket.io"],
      "images": [
        {
          "id": 1,
          "image": "intercambia.webp"
        },
        {
          "id": 2,
          "image": "intercambia_dos.webp"
        },
        {
          "id": 3,
          "image": "intercambia_tres.webp"
        },
        {
          "id": 4,
          "image": "intercambia_cuatro.webp"
        }
      ]
    }
  ]
}
